---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.RebarShapeParamEndHookTanLen
source: html/cf34ac97-1953-0cc2-522d-53d4aa3b0196.htm
---
# Autodesk.Revit.DB.ParameterTypeId.RebarShapeParamEndHookTanLen Property

"End Tangent Hook Length"

## Syntax (C#)
```csharp
public static ForgeTypeId RebarShapeParamEndHookTanLen { get; }
```